#-------- 리스트 형태

# 튜플
a_list = ("키움", "카카오", "대신")
for val in a_list:
    print(val)


# 리스트
##################################
a_list = ["키움", "카카오", "네이버"]
for val in a_list:
    print(val)
##################################

##################################
a_list = ["키움", "카카오", "네이버"]
a_list.append("대신증권")
for val in a_list:
    print(val)
##################################

print(a_list[0])

##################################
a_list = ["키움", "카카오", "네이버"] #list
a_list[2] = "다음" #수정하기
del a_list[1] #삭제하기
##################################

##################################
a_list = ["키움", "카카오", "네이버"]
for idx, val in enumerate(a_list):  #enumerate(a_list) 처럼 감싸면은 index와 value 값이 같이 출력됨
    print("인덱스: %s, 값: %s" % (idx, val))
##################################


#딕셔너리
##################################
a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
print(a_dict.get("키움증권")) #가져오기
print(a_dict['키움증권']) #이렇게도 가져올 수 있음.
##################################

##################################
a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
for key in a_dict.keys():
    print(a_dict.get(key))
##################################

##################################
a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
for key, value in a_dict.items():  #key와 value 값 모두 가져옴
   print("키값 : %s , value값 : %s" % (key, value))
##################################

##################################
a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
a_dict["다음증권"] = 2500
print(a_dict)
##################################

##################################
a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
a_dict.update({"다음증권":2000})
print(a_dict)
##################################

##################################
a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
a_dict["다음증권"] = 2500
a_dict["애플"] = 152000
a_dict["삼성"] = 221500
a_dict["LG"] = 25800

a_dict = {"키움증권":1300, "카카오증권":1500, "네이버증권":1000}
a_dict.update({"다음증권":2000, "애플":152000, "삼성":221500, "LG":25800})
##################################